In [29]:
import sqlite3
import pandas as pd 

# Conectar um banco de datos ou crear
conn = sqlite3.connect('teste.db')

# Crear un objeto cursos
cursor = conn.cursor()

#cursor.execute('''
#        DROP TABLE IF EXISTS tablacliente''')

In [24]:
# Crear una tabla nombre
cursor.execute('''
    CREATE TABLE IF NOT EXISTS tablacliente(
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        cliente TEXT NOT NULL)''')

conn.commit()
print('Tabla creada con éxito.')

Tabla creada con éxito.

In [16]:
# Crear otra tabla productos
cursor.execute('''
    CREATE TABLE IF NOT EXISTS tablaprod(
        id_produucto INTEGER PRIMARY KEY AUTOINCREMENT,
        producto TEXT NOT NULL,
        precio FLOAT NOT NULL)''')

conn.commit()
print('Tabla de productos creada com éxito.')

Tabla de productos creada com éxito.

In [ ]:
# Insertar datos en la tabla de clientes
cursor.execute('''
    INSERT INTO tablacliente
               (cliente)
               VALUES
               ('A'),
               ('B'),
               ('C'),
               ('D'),
               ('E'),
               ('F'),
               ('G'),
               ('H'),
               ('I'),
               ('J')''')

conn.commit()
print('Datos commitados con suceso.')

cursor.execute('''
        SELECT * FROM tablacliente''')
cursor.fetchall()

Datos commitados con suceso.

[(1, 'A'),
 (2, 'B'),
 (3, 'C'),
 (4, 'D'),
 (5, 'E'),
 (6, 'F'),
 (7, 'G'),
 (8, 'H'),
 (9, 'I'),
 (10, 'J')]

In [30]:
# Consultar datos de la tabla de clientes usando pandas
query = '''
        SELECT * FROM tablacliente'''
df = pd.read_sql_query(query, conn)
#conn.close()
print(df)

   id cliente
0   1       A
1   2       B
2   3       C
3   4       D
4   5       E
5   6       F
6   7       G
7   8       H
8   9       I
9  10       J

In [19]:
# Insertar datos en la tabla de productos
cursor.execute('''
        INSERT INTO tablaprod
            (producto, precio)
            VALUES
            ('Producto A', 10.99),
            ('Producto B', 20.49),
            ('Producto C', 15.75),
            ('Producto D', 8.99),
            ('Producto E', 12.50),
            ('Producto F', 5.99),
            ('Producto G', 30.00),
            ('Producto H', 25.00),
            ('Producto I', 18.75),
            ('Producto J', 22.30),
            ('Producto K', 9.99),
            ('Producto L', 14.99),
            ('Producto M', 19.99),
            ('Producto N', 11.49),
            ('Producto O', 17.89),
            ('Producto P', 13.50),
            ('Producto Q', 21.99),
            ('Producto R', 16.75),
            ('Producto S', 27.50),
            ('Producto T', 24.99),
            ('Producto U', 29.99),
            ('Producto V', 28.49),
            ('Producto W', 23.75),
            ('Producto X', 26.99),
            ('Producto Y', 31.50),
            ('Producto Z', 32.00)''')
conn.commit()
print('Datos de productos commitados con suceso.')

cursor.execute('''
        SELECT * FROM tablaprod''')
cursor.fetchall()

Datos de productos commitados con suceso.

[(1, 'Producto A', 10.99),
 (2, 'Producto B', 20.49),
 (3, 'Producto C', 15.75),
 (4, 'Producto D', 8.99),
 (5, 'Producto E', 12.5),
 (6, 'Producto F', 5.99),
 (7, 'Producto G', 30.0),
 (8, 'Producto H', 25.0),
 (9, 'Producto I', 18.75),
 (10, 'Producto J', 22.3),
 (11, 'Producto K', 9.99),
 (12, 'Producto L', 14.99),
 (13, 'Producto M', 19.99),
 (14, 'Producto N', 11.49),
 (15, 'Producto O', 17.89),
 (16, 'Producto P', 13.5),
 (17, 'Producto Q', 21.99),
 (18, 'Producto R', 16.75),
 (19, 'Producto S', 27.5),
 (20, 'Producto T', 24.99),
 (21, 'Producto U', 29.99),
 (22, 'Producto V', 28.49),
 (23, 'Producto W', 23.75),
 (24, 'Producto X', 26.99),
 (25, 'Producto Y', 31.5),
 (26, 'Producto Z', 32.0)]

In [32]:
# Consultar datos de la tabla de productos usando pandas

query = '''
    SELECT * FROM tablaprod'''
df_prod = pd.read_sql_query(query,conn)
#conn.close()
print(df_prod)

    id_produucto    producto  precio
0              1  Producto A   10.99
1              2  Producto B   20.49
2              3  Producto C   15.75
3              4  Producto D    8.99
4              5  Producto E   12.50
5              6  Producto F    5.99
6              7  Producto G   30.00
7              8  Producto H   25.00
8              9  Producto I   18.75
9             10  Producto J   22.30
10            11  Producto K    9.99
11            12  Producto L   14.99
12            13  Producto M   19.99
13            14  Producto N   11.49
14            15  Producto O   17.89
15            16  Producto P   13.50
16            17  Producto Q   21.99
17            18  Producto R   16.75
18            19  Producto S   27.50
19            20  Producto T   24.99
20            21  Producto U   29.99
21            22  Producto V   28.49
22            23  Producto W   23.75
23            24  Producto X   26.99
24            25  Producto Y   31.50
25            26  Producto Z   32.00

In [20]:
# Crear una tabla de ventas
cursor.execute('''
        CREATE TABLE IF NOT EXISTS ventas(
            id_venta INTEGER PRIMARY KEY AUTOINCREMENT,
            valor_venta FLOAT NOT NULL,
            id_cliente INTEGER NOT NULL,
            id_producto INTEGER NOT NULL,
            FOREIGN KEY (id_cliente) REFERENCES tablacliente(id),
            FOREIGN KEY (id_producto) REFERENCES tablaprod(id_producto))
            ''')
conn.commit()
print('Tabla de ventas creada com sucesso.')

Tabla de ventas creada com sucesso.

In [21]:
# Insertar datos en la tabla de ventas
cursor.execute('''
        INSERT INTO ventas
            (valor_venta, id_cliente, id_producto)
            VALUES
            (100.50, 1, 1),
            (200.75, 2, 2),
            (150.00, 3, 3),
            (80.25, 4, 4),
            (120.00, 5, 5),
            (90.50, 6, 6),
            (300.00, 7, 7),
            (250.00, 8, 8),
            (180.75, 9, 9),
            (220.30, 10, 10),
            (110.99, 10, 11),
            (140.99, 10, 12),
            (190.99, 10, 13),
            (115.49, 1, 14),
            (175.89, 1, 15),
            (135.50, 1, 16),
            (219.99, 1, 17),
            (167.75, 2, 18),
            (275.50, 2, 19),
            (249.99, 2, 20),
            (299.99, 2, 21),
            (284.49, 3, 22),
            (237.75, 3, 23),
            (269.99, 3, 24),
            (315.50, 3, 25),
            (322.00, 4, 26),
            (330.00, 4, 26),
            (340.00, 4, 2),
            (350.00, 4, 25),
            (360.00, 5, 22),
            (370.00, 5, 23),
            (380.00, 5, 24),
            (390.00, 5, 25),
            (400.00, 6, 26),
            (410.00, 6, 2),
            (420.00, 6, 10),
            (430.00, 6, 11),
            (440.00, 7, 12),
            (450.00, 7, 13),
            (460.00, 7, 14),
            (470.00, 7, 15),
            (480.00, 8, 16),
            (490.00, 8, 17),
            (500.00, 8, 18),
            (510.00, 8, 19),
            (520.00, 9, 20),
            (530.00, 9, 21),
            (540.00, 9, 22),
            (550.00, 9, 23),
            (560.00, 10, 24),
            (570.00, 10, 25),
            (580.00, 10, 26),
            (590.00, 10, 2)''')
conn.commit()
print('Datos de ventas commitados com sucesso.')

Datos de ventas commitados com sucesso.

In [34]:
# Consultar datos de la tabla de ventas usando pandas
query = ''' 
    SELECT * FROM ventas'''
df_ventas = pd.read_sql_query(query, conn)
print(df_ventas)

    id_venta  valor_venta  id_cliente  id_producto
0          1       100.50           1            1
1          2       200.75           2            2
2          3       150.00           3            3
3          4        80.25           4            4
4          5       120.00           5            5
5          6        90.50           6            6
6          7       300.00           7            7
7          8       250.00           8            8
8          9       180.75           9            9
9         10       220.30          10           10
10        11       110.99          10           11
11        12       140.99          10           12
12        13       190.99          10           13
13        14       115.49           1           14
14        15       175.89           1           15
15        16       135.50           1           16
16        17       219.99           1           17
17        18       167.75           2           18
18        19       275.50           2           19
19        20       249.99           2           20
20        21       299.99           2           21
21        22       284.49           3           22
22        23       237.75           3           23
23        24       269.99           3           24
24        25       315.50           3           25
25        26       322.00           4           26
26        27       330.00           4           26
27        28       340.00           4            2
28        29       350.00           4           25
29        30       360.00           5           22
30        31       370.00           5           23
31        32       380.00           5           24
32        33       390.00           5           25
33        34       400.00           6           26
34        35       410.00           6            2
35        36       420.00           6           10
36        37       430.00           6           11
37        38       440.00           7           12
38        39       450.00           7           13
39        40       460.00           7           14
40        41       470.00           7           15
41        42       480.00           8           16
42        43       490.00           8           17
43        44       500.00           8           18
44        45       510.00           8           19
45        46       520.00           9           20
46        47       530.00           9           21
47        48       540.00           9           22
48        49       550.00           9           23
49        50       560.00          10           24
50        51       570.00          10           25
51        52       580.00          10           26
52        53       590.00          10            2

In [ ]:
# Manipular datos con comando SELECT
query = ''' 
    SELECT * FROM ventas
    WHERE (SELECT sum(valor_venta) FROM ventas) and id_cliente between 1 and 5
    ORDER BY id_cliente ASC'''
df_ventas_sorted = pd.read_sql_query(query, conn)
print(df_ventas_sorted)

    id_venta  valor_venta  id_cliente  id_producto
0          1       100.50           1            1
1         14       115.49           1           14
2         16       135.50           1           16
3         15       175.89           1           15
4         17       219.99           1           17
5         18       167.75           2           18
6          2       200.75           2            2
7         20       249.99           2           20
8         19       275.50           2           19
9         21       299.99           2           21
10         3       150.00           3            3
11        23       237.75           3           23
12        24       269.99           3           24
13        22       284.49           3           22
14        25       315.50           3           25
15         4        80.25           4            4
16        26       322.00           4           26
17        27       330.00           4           26
18        28       340.00           4            2
19        29       350.00           4           25
20         5       120.00           5            5
21        30       360.00           5           22
22        31       370.00           5           23
23        32       380.00           5           24
24        33       390.00           5           25